# LayerModifier Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LayerModifier Constructor
LayerModifier Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LayerModifier()()()() | Constructs a new LayerModifier with default values. |
| LayerModifier(ModifierType, String) | Constructs a new LayerModifier with modifierType and separator. |

# See Also
LayerModifier Class
LayerModifier Members
Autodesk.Revit.DB Namespace